In [1]:
import pandas as pd

### How to create series from list

In [2]:
num = [45,10,38,67,89,100,200,230]

In [3]:
num_ser = pd.Series(num)

In [4]:
num_ser

0     45
1     10
2     38
3     67
4     89
5    100
6    200
7    230
dtype: int64

In [5]:
type(num_ser)

pandas.core.series.Series

In [6]:
ice_cream = ["Chocolate", "Vanilla", "Strawberry", "Rum Raisin","Chocolate","Vanilla"]

data = pd.Series(ice_cream)
data

0     Chocolate
1       Vanilla
2    Strawberry
3    Rum Raisin
4     Chocolate
5       Vanilla
dtype: object

### How to create series from dictionary

In [7]:
data_dict = {"A":65,"B":66,"C":67,"D":68,"E":69,"F":70}

In [8]:
data_dict

{'A': 65, 'B': 66, 'C': 67, 'D': 68, 'E': 69, 'F': 70}

In [9]:
dict_ser = pd.Series(data_dict)

In [10]:
dict_ser

A    65
B    66
C    67
D    68
E    69
F    70
dtype: int64

In [11]:
type(dict_ser)

pandas.core.series.Series

In [12]:
num_ser.values

array([ 45,  10,  38,  67,  89, 100, 200, 230], dtype=int64)

In [13]:
num_ser.index

RangeIndex(start=0, stop=8, step=1)

### math function for series

In [14]:
num_ser.sum()

779

In [15]:
num_ser.max()

230

In [16]:
num_ser.min()

10

In [17]:
num_ser.std()

78.39813682188408

In [18]:
num_ser.sum()

779

In [19]:
num_ser.mean()

97.375

In [37]:
num_ser.median()

78.0

In [20]:
num_ser.describe()

count      8.000000
mean      97.375000
std       78.398137
min       10.000000
25%       43.250000
50%       78.000000
75%      125.000000
max      230.000000
dtype: float64

In [21]:
len(num_ser)

8

In [22]:
sorted(num_ser)

[10, 38, 45, 67, 89, 100, 200, 230]

### How to set index in series

In [23]:
fruits = ["Apple", "Orange", "Plum", "Grape", "Blueberry"]
weekdays = ["Monday", "Tuesday", "Wednesday", "Thursday", "Friday"]
pd.Series(fruits, weekdays)

Monday           Apple
Tuesday         Orange
Wednesday         Plum
Thursday         Grape
Friday       Blueberry
dtype: object

In [24]:
pd.Series(data = fruits, index = weekdays)

Monday           Apple
Tuesday         Orange
Wednesday         Plum
Thursday         Grape
Friday       Blueberry
dtype: object

In [25]:
pd.Series(fruits, index = weekdays)

Monday           Apple
Tuesday         Orange
Wednesday         Plum
Thursday         Grape
Friday       Blueberry
dtype: object

In [26]:
temp = [41.2,42.3,41.5,42.4,42.5,43.6,43.7]

weekdays = ['Monday','Tuesday','Wednessday','Thrusday','Friday','Saturday','Sunday']

week_series = pd.Series(temp,index=weekdays)

In [27]:
week_series

Monday        41.2
Tuesday       42.3
Wednessday    41.5
Thrusday      42.4
Friday        42.5
Saturday      43.6
Sunday        43.7
dtype: float64

In [28]:
temp = [41.2,42.3,41.5,42.4,42.5,43.6,43.7]

weekdays = ['Monday','Tuesday','Wednessday','Thrusday','Friday','Saturday','Sunday']

week_series = pd.Series(weekdays,index=temp)

In [29]:
week_series

41.2        Monday
42.3       Tuesday
41.5    Wednessday
42.4      Thrusday
42.5        Friday
43.6      Saturday
43.7        Sunday
dtype: object

### How to sort sereis data

- sort_values
- sort_index

In [30]:
week_series = week_series.sort_values(ascending=False)

In [31]:
week_series

41.5    Wednessday
42.3       Tuesday
42.4      Thrusday
43.7        Sunday
43.6      Saturday
41.2        Monday
42.5        Friday
dtype: object

In [32]:
week_series = week_series.sort_index(ascending=True)

In [33]:
week_series

41.2        Monday
41.5    Wednessday
42.3       Tuesday
42.4      Thrusday
42.5        Friday
43.6      Saturday
43.7        Sunday
dtype: object

In [34]:
num_ser.sort_values(ascending=False)

7    230
6    200
5    100
4     89
3     67
0     45
2     38
1     10
dtype: int64

In [35]:
num_ser.sort_index(ascending=False)

7    230
6    200
5    100
4     89
3     67
2     38
1     10
0     45
dtype: int64

In [36]:
num_ser.count()

8

### How to create series data from csv file

In [39]:
data = pd.read_csv('employees.csv')

In [40]:
data

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
995,Henry,NaN,11/23/2014,6:09 AM,132483,16.655,False,Distribution
996,Phillip,Male,1/31/1984,6:30 AM,42392,19.675,False,Finance
997,Russell,Male,5/20/2013,12:39 PM,96914,1.421,False,Product
998,Larry,Male,4/20/2013,4:45 PM,60500,11.985,False,Business Development
999,Albert,Male,5/15/2012,6:24 PM,129949,10.169,True,Sales

In [29]:
data.shape

(1000, 8)

In [32]:
data.head(2)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN

In [35]:
data.tail(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
997,Russell,Male,5/20/2013,12:39 PM,96914,1.421,False,Product
998,Larry,Male,4/20/2013,4:45 PM,60500,11.985,False,Business Development
999,Albert,Male,5/15/2012,6:24 PM,129949,10.169,True,Sales

In [36]:
data = pd.read_csv("employees.csv",usecols=['Salary'],squeeze=True)

In [37]:
data

0       97308
1       61933
2      130590
3      138705
4      101004
        ...
995    132483
996     42392
997     96914
998     60500
999    129949
Name: Salary, Length: 1000, dtype: int64

In [38]:
data.value_counts()

121160    2
145988    2
147183    2
86676     2
91462     2
         ..
75661     1
144677    1
66851     1
81183     1
69111     1
Name: Salary, Length: 995, dtype: int64

In [41]:
d1 = data['Salary']

In [42]:
type(d1)

pandas.core.series.Series

In [43]:
d1.describe()

count      1000.000000
mean      90662.181000
std       32923.693342
min       35013.000000
25%       62613.000000
50%       90428.000000
75%      118740.250000
max      149908.000000
Name: Salary, dtype: float64

In [33]:
data.value_counts(ascending=False)

Vanilla       2
Chocolate     2
Strawberry    1
Rum Raisin    1
dtype: int64

### Apply and map function

In [39]:
num_ser.apply(lambda x: x+10)

0     55
1     20
2     48
3     77
4     99
5    110
6    210
7    240
dtype: int64

In [43]:
data = ["One","Two","One","Two","Two","One","Two"]

data = pd.Series(data)

In [44]:
data

0    One
1    Two
2    One
3    Two
4    Two
5    One
6    Two
dtype: object

In [48]:

data.map({"One":1,"Two":2})

0    1
1    2
2    1
3    2
4    2
5    1
6    2
dtype: int64